In [1]:
import pandas as pd 
import numpy as np
import re

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### Answer 1

In [4]:
df.iloc[1,1] = 10055
df.iloc[3,1] = 10075
df['FlightNumber'] = df['FlightNumber'].astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

### Answer 2

In [5]:
From = df['From_To'].apply(lambda x: x.split(sep='_')[0])

To = df['From_To'].apply(lambda x: x.split(sep='_')[1])
print(From)
print(To)

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: From_To, dtype: object
0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: From_To, dtype: object

### Answer 3

In [6]:
From = From.map(lambda x: x[0].upper()+x[1:].lower())

To = To.map(lambda x: x[0].upper()+x[1:].lower())

print(From)
print(To)

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From_To, dtype: object
0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: From_To, dtype: object

### Answer 4

In [7]:
del df['From_To']
df['From'], df['To'] = From, To
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

### Answer 5

In [8]:
df2 = pd.DataFrame(df['RecentDelays'].values.tolist())
df2.head()

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [9]:
df2.rename(columns={0:'Delays_1', 1:'Delays_2', 2:'Delays_3'}, inplace=True)
df2

   Delays_1  Delays_2  Delays_3
0      23.0      47.0       NaN
1       NaN       NaN       NaN
2      24.0      43.0      87.0
3      13.0       NaN       NaN
4      67.0      32.0       NaN

In [10]:
df[['Delays_1','Delays_2', 'Delays_3']] = df2[['Delays_1','Delays_2', 'Delays_3']]
df.drop('RecentDelays', axis=1, inplace=True)
df

,FlightNumber,Airline,From,To,Delays_1,Delays_2,Delays_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

# Cleaning the Airline Column

In [11]:
a =df['Airline'].apply(lambda x: re.findall('[A-Za-z]+',x))

In [12]:
a

0                 [KLM]
1         [Air, France]
2    [British, Airways]
3         [Air, France]
4          [Swiss, Air]
Name: Airline, dtype: object

In [13]:
b = []
for i in a:
    if len(i)>1:
        b.append(i[0]+' '+i[1])
    else:
        b.append(i[0])

In [14]:
b

['KLM', 'Air France', 'British Airways', 'Air France', 'Swiss Air']

In [15]:
df['Airline'] = b
df

,FlightNumber,Airline,From,To,Delays_1,Delays_2,Delays_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN